# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "supabase/tap"

# Brews
brew "deno"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "git"
brew "git-lfs"
brew "imagemagick"
brew "node"
brew "deno"
brew "pnpm"
brew "ripgrep"
brew "thefuck"
brew "zsh"
brew "supabase/tap/supabase"

# Casks
cask "adobe-acrobat-reader"
cask "postman"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
