# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "supabase/tap"

# Brews
brew "automake"
brew "pkg-config"
brew "deno"
brew "docker", link: false
brew "libtool"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "git"
brew "git-lfs"
brew "hub"
brew "imagemagick"
brew "node"
brew "pnpm"
brew "ren"
brew "ripgrep"
brew "scc"
brew "thefuck"
brew "tilt"
brew "vips"
brew "zsh"
brew "supabase/tap/supabase"

# Casks
cask "adobe-acrobat-reader"
cask "authy"
cask "docker"
cask "figma"
cask "github"
cask "iterm2"
cask "ngrok"
cask "plex-media-server"
cask "postman"
cask "qbittorrent"
cask "slack"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
