# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"

# Brews
brew "deno"
brew "fnm"
brew "gh"
brew "git"
brew "git-lfs"
brew "imagemagick"
brew "node"
brew "pnpm"
brew "ripgrep"
brew "zsh"
brew "starship"
brew "fzf"
brew "bat"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Casks
cask "adobe-acrobat-reader"
cask "postman"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
cask "ticktick"
cask "spotify"
cask "ghostty"